
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |   🔴 Destroy |
|----------:|---------:|------------:|-------------:|
|        ✅ |       48 |          20 |           10 |
## Affected resources by action

|  Action  | Resources                                                                                                     |
|:--------:|:--------------------------------------------------------------------------------------------------------------|
|    🟢    | `module.actions-runner.aws_autoscaling_policy.scale_in`                                                       |
|    🟢    | `module.actions-runner.aws_autoscaling_policy.scale_out`                                                      |
|    🟢    | `module.actions-runner.aws_cloudwatch_metric_alarm.idle_runners_high`                                         |
|    🟢    | `module.actions-runner.aws_cloudwatch_metric_alarm.idle_runners_low`                                          |
|    🟢    | `module.actions-runner.aws_s3_bucket.lambda_tmp`                                                              |
|    🟢    | `module.actions-runner.aws_s3_bucket_public_access_block.public_access`                                       |
|    🟢    | `module.actions-runner-noble.aws_autoscaling_policy.scale_in`                                                 |
|    🟢    | `module.actions-runner-noble.aws_autoscaling_policy.scale_out`                                                |
|    🟢    | `module.actions-runner-noble.aws_cloudwatch_metric_alarm.idle_runners_high`                                   |
|    🟢    | `module.actions-runner-noble.aws_cloudwatch_metric_alarm.idle_runners_low`                                    |
|    🟢    | `module.actions-runner-noble.aws_s3_bucket.lambda_tmp`                                                        |
|    🟢    | `module.actions-runner-noble.aws_s3_bucket_public_access_block.public_access`                                 |
|    🟢    | `module.actions-runner.module.record_metric.aws_cloudwatch_event_rule.run_every`                              |
|    🟢    | `module.actions-runner.module.record_metric.aws_cloudwatch_event_target.lambda_target`                        |
|    🟢    | `module.actions-runner.module.record_metric.aws_cloudwatch_log_group.lambda`                                  |
|    🟢    | `module.actions-runner.module.record_metric.aws_iam_policy.lambda_logging`                                    |
|    🟢    | `module.actions-runner.module.record_metric.aws_iam_policy.lambda_permissions`                                |
|    🟢    | `module.actions-runner.module.record_metric.aws_iam_role.iam_for_lambda`                                      |
|    🟢    | `module.actions-runner.module.record_metric.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole`       |
|    🟢    | `module.actions-runner.module.record_metric.aws_iam_role_policy_attachment.lambda_logs`                       |
|    🟢    | `module.actions-runner.module.record_metric.aws_iam_role_policy_attachment.lambda_permissions`                |
|    🟢    | `module.actions-runner.module.record_metric.aws_lambda_function.lambda`                                       |
|    🟢    | `module.actions-runner.module.record_metric.aws_lambda_function_event_invoke_config.update_filter`            |
|    🟢    | `module.actions-runner.module.record_metric.aws_lambda_permission.allow_eventbridge`                          |
|    🟢    | `module.actions-runner.module.record_metric.aws_s3_object.lambda_package`                                     |
|    🟢    | `module.actions-runner.module.record_metric.null_resource.install_python_dependencies`                        |
|    🟢    | `module.actions-runner.module.record_metric.random_uuid.lamda_src_hash`                                       |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_cloudwatch_event_rule.run_every`                        |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_cloudwatch_event_target.lambda_target`                  |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_cloudwatch_log_group.lambda`                            |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_iam_policy.lambda_logging`                              |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_iam_policy.lambda_permissions`                          |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_iam_role.iam_for_lambda`                                |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole` |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_iam_role_policy_attachment.lambda_logs`                 |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_iam_role_policy_attachment.lambda_permissions`          |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_lambda_function.lambda`                                 |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_lambda_function_event_invoke_config.update_filter`      |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_lambda_permission.allow_eventbridge`                    |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_s3_object.lambda_package`                               |
|    🟢    | `module.actions-runner-noble.module.record_metric.null_resource.install_python_dependencies`                  |
|    🟢    | `module.actions-runner-noble.module.record_metric.random_uuid.lamda_src_hash`                                 |
|    🟡    | `module.actions-runner.aws_autoscaling_group.actions-runner`                                                  |
|    🟡    | `module.actions-runner.aws_iam_policy.required`                                                               |
|    🟡    | `module.actions-runner.aws_launch_template.actions-runner`                                                    |
|    🟡    | `module.actions-runner-noble.aws_autoscaling_group.actions-runner`                                            |
|    🟡    | `module.actions-runner-noble.aws_iam_policy.required`                                                         |
|    🟡    | `module.actions-runner-noble.aws_launch_template.actions-runner`                                              |
|    🟡    | `module.actions-runner.module.instance-profile.aws_iam_policy.profile`                                        |
|    🟡    | `module.actions-runner.module.registration.aws_cloudwatch_event_rule.scale`                                   |
|    🟡    | `module.actions-runner.module.registration.aws_cloudwatch_log_group.lambda`                                   |
|    🟡    | `module.actions-runner.module.registration.aws_iam_policy.lambda_logging`                                     |
|    🟡    | `module.actions-runner.module.registration.aws_iam_policy.lambda_permissions`                                 |
|    🟡    | `module.actions-runner.module.registration.aws_iam_role.lambda`                                               |
|    🟡    | `module.actions-runner.module.registration.aws_lambda_function.main`                                          |
|    🟡    | `module.actions-runner-noble.module.instance-profile.aws_iam_policy.profile`                                  |
|    🟡    | `module.actions-runner-noble.module.registration.aws_cloudwatch_event_rule.scale`                             |
|    🟡    | `module.actions-runner-noble.module.registration.aws_cloudwatch_log_group.lambda`                             |
|    🟡    | `module.actions-runner-noble.module.registration.aws_iam_policy.lambda_logging`                               |
|    🟡    | `module.actions-runner-noble.module.registration.aws_iam_policy.lambda_permissions`                           |
|    🟡    | `module.actions-runner-noble.module.registration.aws_iam_role.lambda`                                         |
|    🟡    | `module.actions-runner-noble.module.registration.aws_lambda_function.main`                                    |
|    🔴    | `module.actions-runner.module.registration.aws_s3_bucket.lambda_tmp`                                          |
|    🔴    | `module.actions-runner.module.registration.aws_s3_bucket_public_access_block.public_access`                   |
|    🔴    | `module.actions-runner-noble.module.registration.aws_s3_bucket.lambda_tmp`                                    |
|    🔴    | `module.actions-runner-noble.module.registration.aws_s3_bucket_public_access_block.public_access`             |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.actions-runner.data.aws_iam_policy_document.required_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = []

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
              + "autoscaling:SetInstanceHealth",
            ]
          + resources = [
              + "arn:aws:autoscaling:us-west-1:303467602807:autoScalingGroup:c9a04b5f-f15b-462c-b2d3-d97e3ffa482f:autoScalingGroupName/actions-runner-2024122120350701390000000c-9wY7dU",
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + "arn:aws:secretsmanager:us-west-1:303467602807:secret:GH-reg-token-s5ggqH-*",
            ]
        }
    }

  # module.actions-runner.aws_autoscaling_group.actions-runner will be updated in-place
  ~ resource "aws_autoscaling_group" "actions-runner" {
        id                               = "actions-runner-2024122120350701390000000c-9wY7dU"
        name                             = "actions-runner-2024122120350701390000000c-9wY7dU"
        # (31 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "11" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (10 unchanged blocks hidden)
    }

  # module.actions-runner.aws_autoscaling_policy.scale_in will be created
  + resource "aws_autoscaling_policy" "scale_in" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = "actions-runner-2024122120350701390000000c-9wY7dU"
      + cooldown                = 180
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "scale-in-idle-runners"
      + policy_type             = "SimpleScaling"
      + scaling_adjustment      = -1
    }

  # module.actions-runner.aws_autoscaling_policy.scale_out will be created
  + resource "aws_autoscaling_policy" "scale_out" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = "actions-runner-2024122120350701390000000c-9wY7dU"
      + cooldown                = 180
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "scale-out-idle-runners"
      + policy_type             = "SimpleScaling"
      + scaling_adjustment      = 1
    }

  # module.actions-runner.aws_cloudwatch_metric_alarm.idle_runners_high will be created
  + resource "aws_cloudwatch_metric_alarm" "idle_runners_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Too many idle runners"
      + alarm_name                            = "IdleRunnersTooHigh-actions-runner-2024122120350701390000000c-9wY7dU"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "asg_name" = "actions-runner-2024122120350701390000000c-9wY7dU"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + metric_name                           = "IdleRunners"
      + namespace                             = "GitHubRunners"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.actions-runner.aws_cloudwatch_metric_alarm.idle_runners_low will be created
  + resource "aws_cloudwatch_metric_alarm" "idle_runners_low" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Idle runners below safe threshold"
      + alarm_name                            = "IdleRunnersTooLow-actions-runner-2024122120350701390000000c-9wY7dU"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "asg_name" = "actions-runner-2024122120350701390000000c-9wY7dU"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + metric_name                           = "IdleRunners"
      + namespace                             = "GitHubRunners"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.actions-runner.aws_iam_policy.required will be updated in-place
  ~ resource "aws_iam_policy" "required" {
        id               = "arn:aws:iam::303467602807:policy/terraform-20241221203559213900000015"
        name             = "terraform-20241221203559213900000015"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "autoscaling:SetInstanceHealth",
                          - "autoscaling:DescribeAutoScalingInstances",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:303467602807:autoScalingGroup:c9a04b5f-f15b-462c-b2d3-d97e3ffa482f:autoScalingGroupName/actions-runner-2024122120350701390000000c-9wY7dU"
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:GH-reg-token-s5ggqH-*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.actions-runner.aws_launch_template.actions-runner will be updated in-place
  ~ resource "aws_launch_template" "actions-runner" {
        id                                   = "lt-0f9802e01406e3f46"
      ~ image_id                             = "ami-0201088f0c6b513c2" -> "ami-07fd1c322c2f6269b"
      ~ latest_version                       = 11 -> (known after apply)
        name                                 = "actions-runner-2024122120350701390000000c"
        tags                                 = {
            "account"           = "303467602807"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.actions-runner.aws_s3_bucket.lambda_tmp will be created
  + resource "aws_s3_bucket" "lambda_tmp" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "infrahouse-action-runner-lambda-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all                    = {
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.actions-runner.aws_s3_bucket_public_access_block.public_access will be created
  + resource "aws_s3_bucket_public_access_block" "public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.actions-runner-noble.data.aws_iam_policy_document.required_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = []

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
              + "autoscaling:SetInstanceHealth",
            ]
          + resources = [
              + "arn:aws:autoscaling:us-west-1:303467602807:autoScalingGroup:61960432-d131-410a-af87-9e86572e6b3e:autoScalingGroupName/actions-runner-20250324032323830500000002-sdnQE5",
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + "arn:aws:secretsmanager:us-west-1:303467602807:secret:GH-reg-token-WvfsZW-*",
            ]
        }
    }

  # module.actions-runner-noble.aws_autoscaling_group.actions-runner will be updated in-place
  ~ resource "aws_autoscaling_group" "actions-runner" {
        id                               = "actions-runner-20250324032323830500000002-sdnQE5"
        name                             = "actions-runner-20250324032323830500000002-sdnQE5"
        # (31 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "3" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (10 unchanged blocks hidden)
    }

  # module.actions-runner-noble.aws_autoscaling_policy.scale_in will be created
  + resource "aws_autoscaling_policy" "scale_in" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = "actions-runner-20250324032323830500000002-sdnQE5"
      + cooldown                = 180
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "scale-in-idle-runners"
      + policy_type             = "SimpleScaling"
      + scaling_adjustment      = -1
    }

  # module.actions-runner-noble.aws_autoscaling_policy.scale_out will be created
  + resource "aws_autoscaling_policy" "scale_out" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = "actions-runner-20250324032323830500000002-sdnQE5"
      + cooldown                = 180
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "scale-out-idle-runners"
      + policy_type             = "SimpleScaling"
      + scaling_adjustment      = 1
    }

  # module.actions-runner-noble.aws_cloudwatch_metric_alarm.idle_runners_high will be created
  + resource "aws_cloudwatch_metric_alarm" "idle_runners_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Too many idle runners"
      + alarm_name                            = "IdleRunnersTooHigh-actions-runner-20250324032323830500000002-sdnQE5"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "asg_name" = "actions-runner-20250324032323830500000002-sdnQE5"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + metric_name                           = "IdleRunners"
      + namespace                             = "GitHubRunners"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.actions-runner-noble.aws_cloudwatch_metric_alarm.idle_runners_low will be created
  + resource "aws_cloudwatch_metric_alarm" "idle_runners_low" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Idle runners below safe threshold"
      + alarm_name                            = "IdleRunnersTooLow-actions-runner-20250324032323830500000002-sdnQE5"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "asg_name" = "actions-runner-20250324032323830500000002-sdnQE5"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + metric_name                           = "IdleRunners"
      + namespace                             = "GitHubRunners"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.actions-runner-noble.aws_iam_policy.required will be updated in-place
  ~ resource "aws_iam_policy" "required" {
        id               = "arn:aws:iam::303467602807:policy/terraform-2025032403240580660000000b"
        name             = "terraform-2025032403240580660000000b"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "autoscaling:SetInstanceHealth",
                          - "autoscaling:DescribeAutoScalingInstances",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:303467602807:autoScalingGroup:61960432-d131-410a-af87-9e86572e6b3e:autoScalingGroupName/actions-runner-20250324032323830500000002-sdnQE5"
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:GH-reg-token-WvfsZW-*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.actions-runner-noble.aws_launch_template.actions-runner will be updated in-place
  ~ resource "aws_launch_template" "actions-runner" {
        id                                   = "lt-01feafb8075d6a58c"
      ~ image_id                             = "ami-0615a53b3317b7031" -> "ami-0d3274c4129454aa7"
      ~ latest_version                       = 3 -> (known after apply)
        name                                 = "actions-runner-20250324032323830500000002"
        tags                                 = {
            "account"           = "303467602807"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.actions-runner-noble.aws_s3_bucket.lambda_tmp will be created
  + resource "aws_s3_bucket" "lambda_tmp" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "infrahouse-action-runner-lambda-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all                    = {
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.actions-runner-noble.aws_s3_bucket_public_access_block.public_access will be created
  + resource "aws_s3_bucket_public_access_block" "public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.actions-runner.module.instance-profile.aws_iam_policy.profile will be updated in-place
  ~ resource "aws_iam_policy" "profile" {
        id               = "arn:aws:iam::303467602807:policy/actions-runner-sbn5RaTtAltb20241221203559214000000016"
        name             = "actions-runner-sbn5RaTtAltb20241221203559214000000016"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "autoscaling:SetInstanceHealth",
                          - "autoscaling:DescribeAutoScalingInstances",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:303467602807:autoScalingGroup:c9a04b5f-f15b-462c-b2d3-d97e3ffa482f:autoScalingGroupName/actions-runner-2024122120350701390000000c-9wY7dU"
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:GH-reg-token-s5ggqH-*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "created_by_module" = "infrahouse/instance-profile/aws"
        }
        # (7 unchanged attributes hidden)
    }

  # module.actions-runner.module.record_metric.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner/modules/record_metric/lambda"
      + type                = "zip"
    }

  # module.actions-runner.module.record_metric.data.aws_iam_policy_document.lambda_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_logging" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:us-west-1:303467602807:log-group:*:log-stream:*",
            ]
        }
    }

  # module.actions-runner.module.record_metric.aws_cloudwatch_event_rule.run_every will be created
  + resource "aws_cloudwatch_event_rule" "run_every" {
      + arn                 = (known after apply)
      + description         = "Trigger Lambda record_metric_actions-runner-2024122120350701390000000c-9wY7dU every minute"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "run-every-minute"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(1 minute)"
      + tags                = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all            = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner.module.record_metric.aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "run-every-minute"
      + target_id      = "send-to-lambda"
    }

  # module.actions-runner.module.record_metric.aws_cloudwatch_log_group.lambda will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/record_metric_actions-runner-2024122120350701390000000c-9wY7dU"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all          = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner.module.record_metric.aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for logging from a lambda record_metric_actions-runner-2024122120350701390000000c-9wY7dU"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_logging"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all         = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner.module.record_metric.aws_iam_policy.lambda_permissions will be created
  + resource "aws_iam_policy" "lambda_permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for a lambda permissions"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_permissions"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:GetCallerIdentity"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "autoscaling:DescribeAutoScalingGroups"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = "cloudwatch:PutMetricData"
                      + Condition = {
                          + StringEquals = {
                              + "cloudwatch:namespace" = "GitHubRunners"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all         = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner.module.record_metric.aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "iam_for_lambda"
      + path                  = "/"
      + tags                  = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all              = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.actions-runner.module.record_metric.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaBasicExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # module.actions-runner.module.record_metric.aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner.module.record_metric.aws_iam_role_policy_attachment.lambda_permissions will be created
  + resource "aws_iam_role_policy_attachment" "lambda_permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner.module.record_metric.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "record_metric_actions-runner-2024122120350701390000000c-9wY7dU"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + s3_bucket                      = (known after apply)
      + s3_key                         = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all                       = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ASG_NAME"           = "actions-runner-2024122120350701390000000c-9wY7dU"
              + "GH_APP_ID"          = "1016363"
              + "GITHUB_ORG_NAME"    = "infrahouse"
              + "GITHUB_SECRET"      = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
              + "GITHUB_SECRET_TYPE" = "pem"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.actions-runner.module.record_metric.aws_lambda_function_event_invoke_config.update_filter will be created
  + resource "aws_lambda_function_event_invoke_config" "update_filter" {
      + function_name          = "record_metric_actions-runner-2024122120350701390000000c-9wY7dU"
      + id                     = (known after apply)
      + maximum_retry_attempts = 0
    }

  # module.actions-runner.module.record_metric.aws_lambda_permission.allow_eventbridge will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "record_metric_actions-runner-2024122120350701390000000c-9wY7dU"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

  # module.actions-runner.module.record_metric.aws_s3_object.lambda_package will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = (known after apply)
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = (known after apply)
      + storage_class          = (known after apply)
      + tags                   = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + version_id             = (known after apply)
    }

  # module.actions-runner.module.record_metric.null_resource.install_python_dependencies will be created
  + resource "null_resource" "install_python_dependencies" {
      + id       = (known after apply)
      + triggers = {
          + "dependencies_version" = "a502cf8854b179715a96efb141e4e72a"
          + "main_version"         = "38c7850f0e812a275d4d5235aa4bd045"
        }
    }

  # module.actions-runner.module.record_metric.random_uuid.lamda_src_hash will be created
  + resource "random_uuid" "lamda_src_hash" {
      + id      = (known after apply)
      + keepers = {
          + "main.py"          = "38c7850f0e812a275d4d5235aa4bd045"
          + "requirements.txt" = "a502cf8854b179715a96efb141e4e72a"
        }
      + result  = (known after apply)
    }

  # module.actions-runner.module.registration.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner/modules/runner_registration/lambda"
      + type                = "zip"
    }

  # module.actions-runner.module.registration.data.aws_iam_policy_document.lambda_logging will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda_logging" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:us-west-1:303467602807:log-group:/aws/lambda/actions-runner-2024122120350701390000000c-9wY7dU_registration",
            ]
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:us-west-1:303467602807:log-group:*:log-stream:*",
            ]
        }
    }

  # module.actions-runner.module.registration.aws_cloudwatch_event_rule.scale will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "scale" {
        id                  = "asg-scale2024122120351288730000000e"
        name                = "asg-scale2024122120351288730000000e"
      ~ tags                = {
            "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      ~ tags_all            = {
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
            # (5 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.actions-runner.module.registration.aws_cloudwatch_log_group.lambda will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/actions-runner-2024122120350701390000000c-9wY7dU_registration"
        name              = "/aws/lambda/actions-runner-2024122120350701390000000c-9wY7dU_registration"
      ~ tags              = {
            "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      ~ tags_all          = {
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.actions-runner.module.registration.aws_iam_policy.lambda_logging will be updated in-place
  ~ resource "aws_iam_policy" "lambda_logging" {
        id               = "arn:aws:iam::303467602807:policy/lambda_logging20241221203521400200000013"
        name             = "lambda_logging20241221203521400200000013"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "logs:CreateLogStream"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:us-west-1:303467602807:log-group:/aws/lambda/actions-runner-2024122120350701390000000c-9wY7dU_registration"
                    },
                  - {
                      - Action   = "logs:PutLogEvents"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:us-west-1:303467602807:log-group:*:log-stream:*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ tags             = {
            "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      ~ tags_all         = {
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.actions-runner.module.registration.aws_iam_policy.lambda_permissions will be updated in-place
  ~ resource "aws_iam_policy" "lambda_permissions" {
        id               = "arn:aws:iam::303467602807:policy/lambda_permissions2024122120351289410000000f"
        name             = "lambda_permissions2024122120351289410000000f"
      ~ tags             = {
            "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      ~ tags_all         = {
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
            # (5 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.actions-runner.module.registration.aws_iam_role.lambda will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "infrahouse-registration20241221203441602900000002"
        name                  = "infrahouse-registration20241221203441602900000002"
      ~ tags                  = {
            "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      ~ tags_all              = {
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
            # (5 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner.module.registration.aws_lambda_function.main will be updated in-place
  ~ resource "aws_lambda_function" "main" {
        id                             = "actions-runner-2024122120350701390000000c-9wY7dU_registration"
      ~ last_modified                  = "2024-12-21T20:35:13.648+0000" -> (known after apply)
      ~ s3_bucket                      = "infrahouse-asg-lambda-20241221203441607300000003" -> (known after apply)
      ~ s3_key                         = "72d931e0-0945-b57d-5008-36e7ee6af2f0.zip" -> (known after apply)
      ~ tags                           = {
            "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      ~ tags_all                       = {
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
            # (5 unchanged elements hidden)
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.actions-runner.module.registration.aws_s3_bucket.lambda_tmp will be destroyed
  # (because aws_s3_bucket.lambda_tmp is not in configuration)
  - resource "aws_s3_bucket" "lambda_tmp" {
      - arn                         = "arn:aws:s3:::infrahouse-asg-lambda-20241221203441607300000003" -> null
      - bucket                      = "infrahouse-asg-lambda-20241221203441607300000003" -> null
      - bucket_domain_name          = "infrahouse-asg-lambda-20241221203441607300000003.s3.amazonaws.com" -> null
      - bucket_prefix               = "infrahouse-asg-lambda-" -> null
      - bucket_regional_domain_name = "infrahouse-asg-lambda-20241221203441607300000003.s3.us-west-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z2F56UZL2M1ACD" -> null
      - id                          = "infrahouse-asg-lambda-20241221203441607300000003" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-west-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "account"           = "303467602807"
          - "created_by_module" = "infrahouse/actions-runner/aws"
          - "environment"       = "development"
          - "service"           = "actions-runner"
        } -> null
      - tags_all                    = {
          - "account"           = "303467602807"
          - "created_by"        = "infrahouse/aws-control-303467602807"
          - "created_by_module" = "infrahouse/actions-runner/aws"
          - "environment"       = "development"
          - "service"           = "actions-runner"
        } -> null
        # (2 unchanged attributes hidden)

      - grant {
          - id          = "eb12b644232bddf2be57e9f92f01e0bbe02d5d81bcdc1af7b4f7e2ccbdbd4008" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.actions-runner.module.registration.aws_s3_bucket_public_access_block.public_access will be destroyed
  # (because aws_s3_bucket_public_access_block.public_access is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "public_access" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "infrahouse-asg-lambda-20241221203441607300000003" -> null
      - id                      = "infrahouse-asg-lambda-20241221203441607300000003" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # module.actions-runner.module.registration.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-asg-lambda-20241221203441607300000003/72d931e0-0945-b57d-5008-36e7ee6af2f0.zip" -> (known after apply)
      ~ bucket                        = "infrahouse-asg-lambda-20241221203441607300000003" -> (known after apply) # forces replacement
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "a284eb88cbc953325f78c2ef18d67192-4" -> (known after apply)
      ~ id                            = "72d931e0-0945-b57d-5008-36e7ee6af2f0.zip" -> (known after apply)
      ~ key                           = "72d931e0-0945-b57d-5008-36e7ee6af2f0.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner/modules/runner_registration/72d931e0-0945-b57d-5008-36e7ee6af2f0.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
      ~ tags                          = {
            "account"           = "303467602807"
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      ~ tags_all                      = {
          + "asg_name"          = "actions-runner-2024122120350701390000000c-9wY7dU"
            # (5 unchanged elements hidden)
        }
      + version_id                    = (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.actions-runner.module.registration.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "4500922781019049797" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "f6ebc7184e6f8938271d2507843314f4" -> "6bf9b5a0ed9a768f2cf1109fae118248"
          ~ "main_version"         = "7ab525ee464d3386128b53849508d538" -> "9c76e8d78e0ee296f1b904854a207898"
        }
    }

  # module.actions-runner.module.registration.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "72d931e0-0945-b57d-5008-36e7ee6af2f0" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "main.py"          = "7ab525ee464d3386128b53849508d538" -> "9c76e8d78e0ee296f1b904854a207898"
          ~ "requirements.txt" = "f6ebc7184e6f8938271d2507843314f4" -> "6bf9b5a0ed9a768f2cf1109fae118248"
        }
      ~ result  = "72d931e0-0945-b57d-5008-36e7ee6af2f0" -> (known after apply)
    }

  # module.actions-runner-noble.module.instance-profile.aws_iam_policy.profile will be updated in-place
  ~ resource "aws_iam_policy" "profile" {
        id               = "arn:aws:iam::303467602807:policy/actions-runner-LVO4bVFWUIxY2025032403240580680000000c"
        name             = "actions-runner-LVO4bVFWUIxY2025032403240580680000000c"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "autoscaling:SetInstanceHealth",
                          - "autoscaling:DescribeAutoScalingInstances",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:303467602807:autoScalingGroup:61960432-d131-410a-af87-9e86572e6b3e:autoScalingGroupName/actions-runner-20250324032323830500000002-sdnQE5"
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:GH-reg-token-WvfsZW-*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "created_by_module" = "infrahouse/instance-profile/aws"
        }
        # (7 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.record_metric.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner-noble/modules/record_metric/lambda"
      + type                = "zip"
    }

  # module.actions-runner-noble.module.record_metric.data.aws_iam_policy_document.lambda_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_logging" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:us-west-1:303467602807:log-group:*:log-stream:*",
            ]
        }
    }

  # module.actions-runner-noble.module.record_metric.aws_cloudwatch_event_rule.run_every will be created
  + resource "aws_cloudwatch_event_rule" "run_every" {
      + arn                 = (known after apply)
      + description         = "Trigger Lambda record_metric_actions-runner-20250324032323830500000002-sdnQE5 every minute"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "run-every-minute"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(1 minute)"
      + tags                = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all            = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner-noble.module.record_metric.aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "run-every-minute"
      + target_id      = "send-to-lambda"
    }

  # module.actions-runner-noble.module.record_metric.aws_cloudwatch_log_group.lambda will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/record_metric_actions-runner-20250324032323830500000002-sdnQE5"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all          = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for logging from a lambda record_metric_actions-runner-20250324032323830500000002-sdnQE5"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_logging"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all         = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_policy.lambda_permissions will be created
  + resource "aws_iam_policy" "lambda_permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for a lambda permissions"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_permissions"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:GetCallerIdentity"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "autoscaling:DescribeAutoScalingGroups"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = "cloudwatch:PutMetricData"
                      + Condition = {
                          + StringEquals = {
                              + "cloudwatch:namespace" = "GitHubRunners"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all         = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "iam_for_lambda"
      + path                  = "/"
      + tags                  = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all              = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaBasicExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_role_policy_attachment.lambda_permissions will be created
  + resource "aws_iam_role_policy_attachment" "lambda_permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "record_metric_actions-runner-20250324032323830500000002-sdnQE5"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + s3_bucket                      = (known after apply)
      + s3_key                         = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all                       = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ASG_NAME"           = "actions-runner-20250324032323830500000002-sdnQE5"
              + "GH_APP_ID"          = "1016363"
              + "GITHUB_ORG_NAME"    = "infrahouse"
              + "GITHUB_SECRET"      = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
              + "GITHUB_SECRET_TYPE" = "pem"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.aws_lambda_function_event_invoke_config.update_filter will be created
  + resource "aws_lambda_function_event_invoke_config" "update_filter" {
      + function_name          = "record_metric_actions-runner-20250324032323830500000002-sdnQE5"
      + id                     = (known after apply)
      + maximum_retry_attempts = 0
    }

  # module.actions-runner-noble.module.record_metric.aws_lambda_permission.allow_eventbridge will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "record_metric_actions-runner-20250324032323830500000002-sdnQE5"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.aws_s3_object.lambda_package will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = (known after apply)
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = (known after apply)
      + storage_class          = (known after apply)
      + tags                   = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + version_id             = (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.null_resource.install_python_dependencies will be created
  + resource "null_resource" "install_python_dependencies" {
      + id       = (known after apply)
      + triggers = {
          + "dependencies_version" = "a502cf8854b179715a96efb141e4e72a"
          + "main_version"         = "38c7850f0e812a275d4d5235aa4bd045"
        }
    }

  # module.actions-runner-noble.module.record_metric.random_uuid.lamda_src_hash will be created
  + resource "random_uuid" "lamda_src_hash" {
      + id      = (known after apply)
      + keepers = {
          + "main.py"          = "38c7850f0e812a275d4d5235aa4bd045"
          + "requirements.txt" = "a502cf8854b179715a96efb141e4e72a"
        }
      + result  = (known after apply)
    }

  # module.actions-runner-noble.module.registration.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner-noble/modules/runner_registration/lambda"
      + type                = "zip"
    }

  # module.actions-runner-noble.module.registration.data.aws_iam_policy_document.lambda_logging will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda_logging" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:us-west-1:303467602807:log-group:/aws/lambda/actions-runner-20250324032323830500000002-sdnQE5_registration",
            ]
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:us-west-1:303467602807:log-group:*:log-stream:*",
            ]
        }
    }

  # module.actions-runner-noble.module.registration.aws_cloudwatch_event_rule.scale will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "scale" {
        id                  = "asg-scale20250324032330006500000004"
        name                = "asg-scale20250324032330006500000004"
      ~ tags                = {
            "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      ~ tags_all            = {
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
            # (5 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.registration.aws_cloudwatch_log_group.lambda will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/actions-runner-20250324032323830500000002-sdnQE5_registration"
        name              = "/aws/lambda/actions-runner-20250324032323830500000002-sdnQE5_registration"
      ~ tags              = {
            "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      ~ tags_all          = {
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.registration.aws_iam_policy.lambda_logging will be updated in-place
  ~ resource "aws_iam_policy" "lambda_logging" {
        id               = "arn:aws:iam::303467602807:policy/lambda_logging20250324032338704000000009"
        name             = "lambda_logging20250324032338704000000009"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "logs:CreateLogStream"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:us-west-1:303467602807:log-group:/aws/lambda/actions-runner-20250324032323830500000002-sdnQE5_registration"
                    },
                  - {
                      - Action   = "logs:PutLogEvents"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:us-west-1:303467602807:log-group:*:log-stream:*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ tags             = {
            "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      ~ tags_all         = {
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.registration.aws_iam_policy.lambda_permissions will be updated in-place
  ~ resource "aws_iam_policy" "lambda_permissions" {
        id               = "arn:aws:iam::303467602807:policy/lambda_permissions20250324032330013400000005"
        name             = "lambda_permissions20250324032330013400000005"
      ~ tags             = {
            "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      ~ tags_all         = {
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
            # (5 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.registration.aws_iam_role.lambda will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "infrahouse-registration20250324031808261700000001"
        name                  = "infrahouse-registration20250324031808261700000001"
      ~ tags                  = {
            "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      ~ tags_all              = {
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
            # (5 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.registration.aws_lambda_function.main will be updated in-place
  ~ resource "aws_lambda_function" "main" {
        id                             = "actions-runner-20250324032323830500000002-sdnQE5_registration"
      ~ last_modified                  = "2025-03-24T03:23:30.970+0000" -> (known after apply)
      ~ s3_bucket                      = "infrahouse-asg-lambda-20250324031808266500000003" -> (known after apply)
      ~ s3_key                         = "fc112e7a-4288-ad2d-7e86-2ca51daa3c5f.zip" -> (known after apply)
      ~ tags                           = {
            "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      ~ tags_all                       = {
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
            # (5 unchanged elements hidden)
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.actions-runner-noble.module.registration.aws_s3_bucket.lambda_tmp will be destroyed
  # (because aws_s3_bucket.lambda_tmp is not in configuration)
  - resource "aws_s3_bucket" "lambda_tmp" {
      - arn                         = "arn:aws:s3:::infrahouse-asg-lambda-20250324031808266500000003" -> null
      - bucket                      = "infrahouse-asg-lambda-20250324031808266500000003" -> null
      - bucket_domain_name          = "infrahouse-asg-lambda-20250324031808266500000003.s3.amazonaws.com" -> null
      - bucket_prefix               = "infrahouse-asg-lambda-" -> null
      - bucket_regional_domain_name = "infrahouse-asg-lambda-20250324031808266500000003.s3.us-west-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z2F56UZL2M1ACD" -> null
      - id                          = "infrahouse-asg-lambda-20250324031808266500000003" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-west-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "account"           = "303467602807"
          - "created_by_module" = "infrahouse/actions-runner/aws"
          - "environment"       = "development"
          - "service"           = "actions-runner"
        } -> null
      - tags_all                    = {
          - "account"           = "303467602807"
          - "created_by"        = "infrahouse/aws-control-303467602807"
          - "created_by_module" = "infrahouse/actions-runner/aws"
          - "environment"       = "development"
          - "service"           = "actions-runner"
        } -> null
        # (2 unchanged attributes hidden)

      - grant {
          - id          = "eb12b644232bddf2be57e9f92f01e0bbe02d5d81bcdc1af7b4f7e2ccbdbd4008" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.actions-runner-noble.module.registration.aws_s3_bucket_public_access_block.public_access will be destroyed
  # (because aws_s3_bucket_public_access_block.public_access is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "public_access" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "infrahouse-asg-lambda-20250324031808266500000003" -> null
      - id                      = "infrahouse-asg-lambda-20250324031808266500000003" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # module.actions-runner-noble.module.registration.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-asg-lambda-20250324031808266500000003/fc112e7a-4288-ad2d-7e86-2ca51daa3c5f.zip" -> (known after apply)
      ~ bucket                        = "infrahouse-asg-lambda-20250324031808266500000003" -> (known after apply) # forces replacement
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "24c387a47f3b160115c179a100793fb3-4" -> (known after apply)
      ~ id                            = "fc112e7a-4288-ad2d-7e86-2ca51daa3c5f.zip" -> (known after apply)
      ~ key                           = "fc112e7a-4288-ad2d-7e86-2ca51daa3c5f.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner-noble/modules/runner_registration/fc112e7a-4288-ad2d-7e86-2ca51daa3c5f.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
      ~ tags                          = {
            "account"           = "303467602807"
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      ~ tags_all                      = {
          + "asg_name"          = "actions-runner-20250324032323830500000002-sdnQE5"
            # (5 unchanged elements hidden)
        }
      + version_id                    = (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.registration.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "3113694923782199734" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "f6ebc7184e6f8938271d2507843314f4" -> "6bf9b5a0ed9a768f2cf1109fae118248"
          ~ "main_version"         = "7ab525ee464d3386128b53849508d538" -> "9c76e8d78e0ee296f1b904854a207898"
        }
    }

  # module.actions-runner-noble.module.registration.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "fc112e7a-4288-ad2d-7e86-2ca51daa3c5f" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "main.py"          = "7ab525ee464d3386128b53849508d538" -> "9c76e8d78e0ee296f1b904854a207898"
          ~ "requirements.txt" = "f6ebc7184e6f8938271d2507843314f4" -> "6bf9b5a0ed9a768f2cf1109fae118248"
        }
      ~ result  = "fc112e7a-4288-ad2d-7e86-2ca51daa3c5f" -> (known after apply)
    }

Plan: 48 to add, 20 to change, 10 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDQ4LCAiY2hhbmdlIjogMjAsICJkZXN0cm95IjogMTB9fQ==
```
</details>